INSERT INTO Employee 
(last_name, first_name, middle_name, cur_position, prev_position, current_salary, hire_date)
VALUES
('Петров', 'Иван', 'Иванович', 'Менеджер по продажам', NULL, 50000, '2021-01-10'),
('Сидоров', 'Павел', 'Владимирович', 'Старший менеджер', 'Менеджер по продажам', 60000, '2020-09-20'),
('Васильев', 'Денис', 'Андреевич', 'Менеджер по продажам', NULL, 45000, '2022-02-14'),
('Кузнецова', 'Мария', 'Сергеевна', 'Администратор', NULL, 40000, '2023-03-01'),
('Ильин', 'Максим', 'Сергеевич', 'Бухгалтер', NULL, 55000, '2019-11-25'),
('Тарасова', 'Виктория', 'Дмитриевна', 'Администратор', 'Оператор call-центра', 42000, '2020-05-10'),
('Александров', 'Егор', 'Петрович', 'Старший менеджер', 'Менеджер по продажам', 62000, '2018-07-10'),
('Федотов', 'Григорий', 'Васильевич', 'Менеджер по продажам', NULL, 47000, '2022-04-05'),
('Ковалева', 'Елена', 'Владимировна', 'Менеджер по продажам', NULL, 53000, '2021-07-19'),
('Семенов', 'Николай', 'Игоревич', 'Руководитель отдела продаж', 'Старший менеджер', 70000, '2017-09-30'),
('Морозов', 'Андрей', 'Евгеньевич', 'Администратор','Оператор склада', 43000, '2019-03-15'),
('Русаков', 'Дмитрий', 'Борисович','Менеджер по продажам', NULL, 49000, '2020-10-10'),
('Никитин', 'Олег', 'Павлович','Старший менеджер','Менеджер по продажам', 59000, '2018-06-01'),
('Ефимова', 'Анна', 'Викторовна', 'Администратор', NULL, 40000, '2023-01-15'),
('Трифонова', 'Дарья', 'Алексеевна', 'Оператор call-центра', NULL, 38000, '2023-04-01');




INSERT INTO Customer (last_name, first_name, middle_name, phone_number, email)
VALUES
('Иванова', 'Татьяна', 'Петровна', '+7 (999) 111-22-33', 't.ivanova@example.com'),
('Фёдоров', 'Сергей', 'Николаевич', '+7 (912) 333-44-55', 's.fedorov@example.com'),
('Алексеева', 'Наталья', 'Дмитриевна', '+7 (921) 444-55-66', 'n.alekseeva@example.com'),
('Кириллова', 'Ольга', 'Сергеевна', '+7 (900) 111-00-11', 'o.kirillova@example.com'),
('Ильина', 'Марина', 'Евгеньевна', '+7 (903) 222-33-44', 'm.ilina@example.com'),
('Кузнецов', 'Максим', 'Петрович', '+7 (904) 555-66-77', 'm.kuznetsov@example.com'),
('Ермаков', 'Владислав', 'Геннадьевич', '+7 (915) 888-99-00', 'v.ermakov@example.com'),
('Гришина', 'Вероника', 'Александровна', '+7 (916) 101-22-33', 'v.grishina@example.com'),
('Степанов', 'Никита', 'Викторович', '+7 (917) 202-33-44', 'n.stepanov@example.com'),
('Жуков', 'Олег', 'Игоревич', '+7 (918) 303-44-55', 'o.zhukov@example.com'),
('Трифонова', 'Дарья', 'Алексеевна', '+7 (919) 404-55-66', 'd.trifonova@example.com'),
('Попов', 'Виталий', 'Станиславович', '+7 (920) 505-66-77', 'v.popov@example.com'),
('Лазарева', 'Алина', 'Борисовна', '+7 (921) 606-77-88', 'a.lazareva@example.com'),
('Осипов', 'Денис', 'Владимирович', '+7 (922) 707-88-99', 'd.osipov@example.com'),
('Савельева', 'Ксения', 'Андреевна', '+7 (923) 808-99-00', 'k.savelyeva@example.com');



INSERT INTO Engine (brand, model, supported_car, price, stock_quantity)
VALUES
('Hyundai', 'G4FA', 'Hyundai Solaris', 45000, 10),
('Kia', 'G4LC', 'Kia Rio', 47000, 5),
('Toyota', '1NZ-FE', 'Toyota Vitz/Yaris', 52000, 7),
('Lada', '21129', 'Lada Vesta', 35000, 9),
('Volkswagen', 'CFNA', 'VW Polo', 55000, 4),
('Renault', 'K4M', 'Renault Logan/Sandero', 36000, 12),
('Nissan', 'HR16DE', 'Nissan Almera', 48000, 6),
('Hyundai', 'G4FC', 'Hyundai Creta', 52000, 3),
('Kia', 'G4FG', 'Kia Ceed', 56000, 2),
('Toyota', '2ZR-FE', 'Toyota Corolla', 58000, 5),
('Volkswagen', 'CHYB', 'VW Polo (новая)', 60000, 6),
('Lada', '21179', 'Lada XRay', 37000, 8),
('Renault', 'H4M', 'Renault Duster', 42000, 11),
('Nissan', 'MR20DE', 'Nissan Qashqai', 65000, 3),
('Toyota', '1G-FE', 'Toyota Mark II', 70000, 2);



INSERT INTO Transmission (brand, model, supported_car, price, stock_quantity)
VALUES
('Hyundai', '6MT-Solaris', 'Hyundai Solaris', 30000, 8),
('Volkswagen', 'DSG-7', 'Volkswagen Polo', 65000, 3),
('Lada', '5MT-Vesta', 'Lada Vesta', 25000, 4),
('Kia', '6MT-Rio', 'Kia Rio', 32000, 5),
('Toyota', 'CVT-K310', 'Toyota Corolla', 55000, 2),
('Renault', 'JR5', 'Renault Logan', 27000, 6),
('Nissan', 'RE0F10A', 'Nissan Almera', 48000, 3),
('Lada', 'AMT-XRay', 'Lada XRay', 30000, 7),
('Hyundai', 'A6GF1', 'Hyundai Creta', 45000, 2),
('Volkswagen', 'MQ200', 'VW Polo (механика)', 28000, 9),
('Toyota', 'U340E', 'Toyota Yaris/Corolla', 50000, 2),
('Renault', 'DP0-AL4', 'Renault Duster', 40000, 4),
('Kia', '7DCT', 'Kia Ceed', 60000, 2),
('Nissan', 'JF015E', 'Nissan Note', 52000, 3),
('Lada', '5MT-Grant', 'Lada Granta', 20000, 10);


INSERT INTO Consumable (name, brand, supported_car, price, stock_quantity)
VALUES
('Масляный фильтр', 'Bosch', 'Hyundai Solaris', 400, 50),
('Свеча зажигания', 'Denso', 'Toyota', 250, 100),
('Антифриз G12', 'Liqui Moly', 'Универсально', 1000, 30),
('Тормозные колодки', 'Ferodo', 'Lada Vesta', 1500, 25),
('Воздушный фильтр', 'Mann', 'Kia Rio', 600, 40),
('Топливный фильтр', 'Bosch', 'Volkswagen Polo', 800, 35),
('Масло 5W-40', 'Shell', 'Универсально', 2200, 60),
('Свеча зажигания иридиевая', 'NGK', 'Nissan/Renault', 450, 70),
('Салонный фильтр', 'Mahle', 'Toyota Corolla', 550, 45),
('Ремень ГРМ', 'Gates', 'Renault Logan', 1400, 20),
('Масляный фильтр', 'Champion', 'Kia Ceed', 420, 55),
('Антифриз Long Life', 'Castrol', 'Универсально', 1200, 25),
('Тормозные колодки', 'Brembo', 'Hyundai Creta', 1800, 15),
('Воздушный фильтр', 'Purflux', 'Lada XRay', 650, 40),
('Масло 0W-20', 'Mobil', 'Toyota', 2500, 50);


INSERT INTO "Order" (order_date, employee_id, customer_id, total_amount)
VALUES
('2023-02-15 10:30:00', 1, 1, 0),
('2023-02-15 11:00:00', 2, 2, 0),
('2023-02-16 09:15:00', 1, 3, 0),
('2023-02-17 14:20:00', 3, 4, 0),
('2023-02-18 16:00:00', 4, 5, 0),
('2023-02-19 12:30:00', 5, 6, 0),
('2023-03-01 09:00:00', 6, 7, 0),
('2023-03-02 13:40:00', 7, 8, 0),
('2023-03-10 15:15:00', 8, 9, 0),
('2023-03-12 11:45:00', 9, 10, 0),
('2023-03-12 13:20:00', 10, 11, 0),
('2023-03-13 17:25:00', 11, 12, 0),
('2023-03-14 10:10:00', 12, 13, 0),
('2023-03-14 10:15:00', 13, 14, 0),
('2023-03-15 09:50:00', 14, 15, 0);


INSERT INTO Order_engine(order_id, engine_id, quantity, price_at_moment)
VALUES
(1, 1, 1, 45000),
(1, 2, 1, 47000),
(2, 3, 1, 52000),
(2, 5, 2, 55000),
(3, 4, 1, 35000),
(4, 1, 1, 45000),
(4, 2, 1, 47000),
(5, 3, 2, 52000),
(5, 8, 1, 52000),
(6, 7, 1, 48000),
(6, 9, 1, 56000),
(7, 10, 1, 58000),
(7, 11, 1, 60000),
(8, 12, 1, 37000),
(8, 13, 1, 42000),
(9, 14, 1, 65000),
(9, 15, 1, 70000),
(10, 1, 1, 45000),
(10, 4, 1, 35000),
(11, 5, 1, 55000),
(11, 6, 2, 36000),
(12, 7, 1, 48000),
(12, 9, 1, 56000),
(13, 2, 1, 47000),
(13, 3, 1, 52000),
(14, 10, 1, 58000),
(14, 12, 1, 37000),
(15, 13, 1, 42000),
(15, 14, 1, 65000),
(15, 15, 1, 70000);


INSERT INTO Order_transmission(order_id, transmission_id, quantity, price_at_moment)
VALUES
(1, 1, 1, 30000),
(1, 2, 1, 65000),
(2, 3, 2, 25000),
(2, 5, 1, 55000),
(3, 4, 1, 32000),
(3, 6, 1, 27000),
(4, 7, 1, 48000),
(5, 1, 1, 30000),
(5, 2, 1, 65000),
(6, 3, 1, 25000),
(6, 8, 1, 30000),
(7, 9, 1, 45000),
(7, 10, 1, 28000),
(8, 11, 1, 50000),
(8, 12, 1, 40000),
(9, 14, 1, 52000),
(10, 15, 1, 20000),
(11, 4, 1, 32000),
(11, 5, 1, 55000),
(12, 6, 1, 27000),
(12, 7, 1, 48000),
(13, 8, 1, 30000),
(13, 9, 1, 45000),
(14, 10, 1, 28000),
(14, 11, 1, 50000),
(15, 12, 1, 40000),
(15, 13, 1, 60000),
(15, 14, 1, 52000),
(15, 2, 1, 65000),
(15, 1, 1, 30000);

INSERT INTO Order_consumable(order_id, consumable_id, quantity, price_at_moment)
VALUES
(1, 1, 2, 400),
(1, 2, 4, 250),
(2, 3, 1, 1000),
(2, 7, 1, 2200),
(3, 4, 1, 1500),
(3, 5, 2, 600),
(4, 6, 1, 800),
(4, 7, 2, 2200),
(5, 8, 4, 450),
(5, 9, 1, 550),
(6, 10, 1, 1400),
(6, 1, 1, 400),
(7, 2, 2, 250),
(7, 3, 1, 1000),
(8, 5, 2, 600),
(8, 6, 2, 800),
(9, 7, 1, 2200),
(10, 8, 2, 450),
(10, 12, 1, 1200),
(11, 11, 1, 420),
(11, 1, 1, 400),
(12, 9, 1, 550),
(12, 14, 1, 650),
(13, 13, 1, 1800),
(13, 15, 2, 2500),
(14, 4, 1, 1500),
(14, 5, 1, 600),
(15, 6, 1, 800),
(15, 8, 1, 450),
(15, 10, 1, 1400),
(15, 12, 1, 1200);


UPDATE "Order" o
SET total_amount = COALESCE(eng_sum,0) + COALESCE(tr_sum,0) + COALESCE(cons_sum,0)
FROM (
  SELECT order_id,
         SUM(price_at_moment * quantity) AS eng_sum
  FROM Order_engine
  GROUP BY order_id
) oe
LEFT JOIN (
  SELECT order_id,
         SUM(price_at_moment * quantity) AS tr_sum
  FROM Order_transmission
  GROUP BY order_id
) ot ON oe.order_id = ot.order_id
LEFT JOIN (
  SELECT order_id,
         SUM(price_at_moment * quantity) AS cons_sum
  FROM Order_consumable
  GROUP BY order_id
) oc ON oe.order_id = oc.order_id
WHERE o.order_id = oe.order_id;